; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-4-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p0-2 - location
	p0-6 - location
	p1-0 - location
	p2-0 - location
	p2-4 - location
	p3-0 - location
	p4-0 - location
	p4-5 - location
	p4-6 - location
	p5-4 - location
	p6-1 - location
	p6-3 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s5)
	(at driver3 s2)
	(at driver4 s1)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s6)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s6)
	(empty truck4)
	(at package1 s1)
	(at package2 s4)
	(at package3 s1)
	(at package4 s1)
	(at package5 s0)
	(at package6 s5)
	(at package7 s4)
	(at package8 s5)
	(at package9 s5)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(link s0 s6)
	(link s6 s0)
	(link s1 s3)
	(link s3 s1)
	(link s1 s4)
	(link s4 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s1)
	(link s1 s2)
	(link s2 s3)
	(link s3 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s6)
	(link s6 s3)
	(link s4 s2)
	(link s2 s4)
	(link s4 s3)
	(link s3 s4)
	(link s4 s5)
	(link s5 s4)
	(link s5 s1)
	(link s1 s5)
	(link s6 s2)
	(link s2 s6)
	(link s6 s5)
	(link s5 s6)
)
	(:goal (and
	(at driver2 s1)
	(at driver3 s5)
	(at driver4 s4)
	(at truck2 s3)
	(at truck4 s1)
	(at package1 s6)
	(at package2 s5)
	(at package3 s3)
	(at package4 s2)
	(at package5 s4)
	(at package7 s3)
	(at package8 s3)
	(at package9 s5)
	))


)

; plan
1. (walk driver1 s5 p4-5)
   deleted: (at driver1 s5)
   added: (at driver1 p4-5)
   goals met: 1 of 13
2. (load-truck s4 package7 truck1)
   deleted: (at package7 s4)
   added: (in package7 truck1)
   goals met: 1 of 13
3. (walk driver1 p4-5 s4)
   deleted: (at driver1 p4-5)
   added: (at driver1 s4)
   goals met: 1 of 13
4. (board-truck driver1 s4 truck1)
   deleted: (at driver1 s4) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 1 of 13
5. (load-truck s4 package2 truck1)
   deleted: (at package2 s4)
   added: (in package2 truck1)
   goals met: 1 of 13
6. (drive-truck driver1 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 1 of 13
7. (drive-truck driver1 s5 s6 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   goals met: 1 of 13
8. (board-truck driver4 s1 truck3)
   deleted: (at driver4 s1) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 1 of 13
9. (load-truck s1 package4 truck3)
   deleted: (at package4 s1)
   added: (in package4 truck3)
   goals met: 1 of 13
10. (load-truck s1 package3 truck3)
   deleted: (at package3 s1)
   added: (in package3 truck3)
   goals met: 1 of 13
11. (load-truck s1 package1 truck3)
   deleted: (at package1 s1)
   added: (in package1 truck3)
   goals met: 1 of 13
12. (drive-truck driver4 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 1 of 13
13. (unload-truck s2 package4 truck3)
   deleted: (in package4 truck3)
   added: (at package4 s2)
   goals met: 2 of 13
14. (drive-truck driver4 s2 s3 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 2 of 13
15. (unload-truck s3 package3 truck3)
   deleted: (in package3 truck3)
   added: (at package3 s3)
   goals met: 3 of 13
16. (walk driver3 s2 p2-4)
   deleted: (at driver3 s2)
   added: (at driver3 p2-4)
   goals met: 3 of 13
17. (walk driver3 p2-4 s4)
   deleted: (at driver3 p2-4)
   added: (at driver3 s4)
   goals met: 3 of 13
18. (walk driver3 s4 p4-5)
   deleted: (at driver3 s4)
   added: (at driver3 p4-5)
   goals met: 3 of 13
19. (walk driver3 p4-5 s5)
   deleted: (at driver3 p4-5)
   added: (at driver3 s5)
   goals met: 4 of 13
20. (drive-truck driver1 s6 s5 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   goals met: 4 of 13
21. (load-truck s5 package8 truck1)
   deleted: (at package8 s5)
   added: (in package8 truck1)
   goals met: 4 of 13
22. (drive-truck driver1 s5 s6 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   goals met: 4 of 13
23. (drive-truck driver4 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 4 of 13
24. (load-truck s0 package5 truck3)
   deleted: (at package5 s0)
   added: (in package5 truck3)
   goals met: 4 of 13
25. (drive-truck driver4 s0 s3 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 4 of 13
26. (drive-truck driver4 s3 s4 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   goals met: 4 of 13
27. (unload-truck s4 package5 truck3)
   deleted: (in package5 truck3)
   added: (at package5 s4)
   goals met: 5 of 13
28. (drive-truck driver4 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 5 of 13
29. (drive-truck driver1 s6 s3 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s3)
   goals met: 5 of 13
30. (unload-truck s3 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s3)
   goals met: 6 of 13
31. (drive-truck driver1 s3 s6 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s6)
   goals met: 6 of 13
32. (disembark-truck driver4 s5 truck3)
   deleted: (driving driver4 truck3)
   added: (at driver4 s5) (empty truck3)
   goals met: 6 of 13
33. (board-truck driver2 s5 truck3)
   deleted: (at driver2 s5) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 6 of 13
34. (walk driver4 s5 p4-5)
   deleted: (at driver4 s5)
   added: (at driver4 p4-5)
   goals met: 6 of 13
35. (walk driver4 p4-5 s4)
   deleted: (at driver4 p4-5)
   added: (at driver4 s4)
   goals met: 7 of 13
36. (drive-truck driver2 s5 s6 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   goals met: 7 of 13
37. (disembark-truck driver2 s6 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s6) (empty truck3)
   goals met: 7 of 13
38. (unload-truck s6 package1 truck3)
   deleted: (in package1 truck3)
   added: (at package1 s6)
   goals met: 8 of 13
39. (drive-truck driver1 s6 s3 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s3)
   goals met: 8 of 13
40. (unload-truck s3 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s3)
   goals met: 9 of 13
41. (drive-truck driver1 s3 s6 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s6)
   goals met: 9 of 13
42. (drive-truck driver1 s6 s5 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   goals met: 9 of 13
43. (board-truck driver2 s6 truck2)
   deleted: (at driver2 s6) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 9 of 13
44. (drive-truck driver2 s6 s3 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s3)
   goals met: 10 of 13
45. (drive-truck driver2 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 9 of 13
46. (disembark-truck driver2 s1 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 10 of 13
47. (walk driver2 s1 p6-1)
   deleted: (at driver2 s1)
   added: (at driver2 p6-1)
   goals met: 9 of 13
48. (unload-truck s5 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s5)
   goals met: 10 of 13
49. (walk driver2 p6-1 s6)
   deleted: (at driver2 p6-1)
   added: (at driver2 s6)
   goals met: 10 of 13
50. (drive-truck driver1 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 10 of 13
51. (disembark-truck driver1 s1 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 10 of 13
52. (board-truck driver1 s1 truck2)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 10 of 13
53. (drive-truck driver1 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 11 of 13
54. (board-truck driver2 s6 truck4)
   deleted: (at driver2 s6) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 11 of 13
55. (drive-truck driver2 s6 s5 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s5)
   goals met: 11 of 13
56. (drive-truck driver2 s5 s1 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s1)
   goals met: 12 of 13
57. (disembark-truck driver2 s1 truck4)
   deleted: (driving driver2 truck4)
   added: (at driver2 s1) (empty truck4)
   goals met: 13 of 13
